[
	{
		"id": 1,
		"header": "Clean Air & a Healthy Planet",
		"description":" Clean air and a sustainable environment are not just ideal goals—they are essential for the survival and prosperity of humanity. By prioritizing eco-friendly practices and education, we can ensure a healthier planet and a brighter future for all. I am a big supporter of recycling and have myself been confused before on what I can or can't recycle, and where to drop off unique items. I hope we can make this easier for everyone.",
		"plan": "I want to build an app that tracks your recycling efforts and measures the impact you've made. The app will also provide education on what and where to recycle, making it easier to contribute to a sustainable future.",
		"image": "recycle.jpg"
	},
	{
		"id": 2,
		"header": "Tolerance, Equality, and Understanding",
		"description":"Fear often stems from a lack of understanding, and people tend to fear what they don't know. In today's world, we’ve grown uncomfortable with exploring beyond our familiar boundaries. By encouraging each other to learn about different cultures, traditions, beliefs, and values, we can realize that at our core, everyone is seeking love and happiness.",
		"plan": "Imagine a platform that breaks us free from the echo chambers created by algorithms, offering a chance to explore the world beyond our usual circles. An app could deliver random shorts, reels, or articles, broadening horizons and fostering a deeper understanding of the diverse world around us.",
		"image": "together.jpg"
	},
	{
		"id": 3,
		"header": "Make Education a Priority & Accessible",
		"description":"An educated society is a safer, more informed one. As history tends to repeat itself, we can't afford to overlook past mistakes. By making learning more accessible and enjoyable, we can improve society for everyone.",
		"plan": "This would be an ambitious project, but I dream of creating an augmented reality app that lets users explore historical sites and key educational locations. This could make learning fun and engaging for all.",
		"image": "learn.jpg"
	},
	{
		"id": 4,
		"header": "Food & Shelter For All",
		"description":"Everyone has the fundamental right to live with dignity, and that begins with access to food and shelter. It’s a difficult issue to confront, but imagining life without a home, that is often compounded by mental illness, is a sobering thought. If we could find better ways to distribute our abundant resources, we could make a real difference in people's lives and provide a positive impact on society.",
		"plan": "One possible solution could involve creating a platform that connects surplus food and available shelters directly with those in need, streamlining the distribution process. ",
		"image": "donate.jpg"
	},
	{
		"id": 5,
		"header": "Get Out & Get Together",
		"description":"I'm the kind of person who loves connecting my friends, but organizing group activities can be a real challenge. I've faced this issue repeatedly when trying to gather people for a disc golf outing. I’d send out a text to one group, wait for responses, and if they couldn’t make it, I'd move on to the next group. The inefficiency was frustrating. It shouldn’t be so hard to get together with friends outside the digital world, especially when we’re so connected online.",
		"plan": "To solve this problem, I proposed it as a school project, and we developed an app called 'In Or Out.' The app simplifies planning by allowing users to create activity cards that friends can easily join. Now, I’m working on a more focused version of the app, specifically designed for organizing disc golf outings.",
		"image": "fun.jpg"
	}
]